[
    {
        "title":"Dining Hall Disaster",
        "image":"https://penmenpress.com/wp-content/uploads/2021/10/Dinning-Hall-Disaster.jpg",
        "imageCaption":"A Dining Hall chicken sandwich served with mold (image courtesy: Calie Wilbar)",
        "category":"NEWS",
        "author":"Lillian Nelson",
        "date":"November 5, 2021",
        "content":"Students have recently noticed some issues in the dining hall with long lines, food quality and moldy products. ~Sodexo responded to the complaints in an interview with Sodexo’s General Manager, Daniel VanAvery. ~As seen on social media platforms such as the SNHU Barstool Instagram, students have reported receiving moldy bread, salad with plastic in it, uncooked steak, uncooked chicken, and rubber bands around broccoli. ~“It was a mistake. I think we got it all squared away. For a week it happened regularly,” said VanAvery when asked about the moldy bread. ~VanAvery explained that some deliveries were marked with the wrong dates when shipped at the beginning of the semester. ~The Sodexo team uses the same method of putting out food as grocery stores do; food expiring sooner goes to the front and food expiring later goes to the back. Thinking the bread was only one day old, as it was labeled, it was brought to the front. In reality it was three days old and was served to some students. ~VanAvery also commented when asked about students finding rubber bands around their stalks of vegetables. He said Sodexo struggled with staffing throughout the pandemic and his staff is “working back-to-back shifts” and putting in long hours at the dining hall, so a couple meals were missed in production and served to students. ~Longer lines have also been a problem in the dining hall, even longer than in previous years on campus. When asked about the matter VanAvery said, “70 percent of their staff is new….We had 50 job openings, staff retired and then the pandemic happened.” Sodexo staff is working long shifts to get through the nearly 30,000 transactions in just a week. ~With new staff needing to be trained and other staff needing to be in different areas in the kitchen, the lines got longer. Staff shortages and delivery issues caused a stir in the dining hall since returning to campus. ~“It was a mistake….It’s not okay. At no point is it okay and…of course, it’s not [Sodexo’s] standard. Our goal is always to serve the best food. Good food every day,” said VanAvery."
    },
    {
        "title":"Time to “Begin Again” With the Release of Taylor’s Version Albums",
        "image":"https://penmenpress.com/wp-content/uploads/2021/10/2657D817-FCA8-4183-96B0-B1A308BBB18E.jpeg",
        "imageCaption":"Taylor Swift’s “Red” Album (image source: Taylor Posik)",
        "category":"ARTS & ENTERTAINMENT",
        "author":"Taylor Posik",
        "date":"November 3, 2021",
        "content":"Singer-songwriter Taylor Swift is set to release her album, “Red (Taylor’s Version),” on November 12. It will include all of the songs from her “Red” album (2012) along with an extended 10-minute song and unheard selections from the vault. Tracks from the vault will feature Chris Stapleton, Phoebe Bridgers, Mark Foster, and Ed Sheeran. ~“I can’t wait til we can dust off our highest hopes and relive these memories together. We’ll also be making a bunch of new ones, too,” Swift said in a social media post. Since the beginning of 2021, Swift has been working on releasing all her previous albums re-recorded. “Fearless (Taylor’s Version),” was released in April and has risen to the number one spot on The Rolling Stones Top 200 Album Chart, according to Rolling Stones Director of Charts, Emily Blake. ~Swift also released a re-recorded single from her “1989” album, “Wildest Dreams” in September. ~Next in the music lineup will be the release of more Taylor’s Version albums, including “Red,” “Speak Now,” “1989,” and “Reputation.” However, Swift will have to wait until 2022 for the latter due to the contract with the previous record label, Big Machine Records. ~Controversy sparked after the artist left Big Machine Records and signed onto Republic Records and Universal Music Group in 2018. In an article explaining why she is re-recording her album, journalist Jessica Sager wrote in Parade, “Swift would later reveal that she attempted to negotiate with Big Machine to gain ownership of the masters of her first six albums but was turned down.” ~This included her not being allowed to perform her old songs at the 2019 AMAs after winning Artist of the Decade. However, the artist was able to perform her original setlist, including the following titles: “The Man,” “Love Story,” “I Knew You Were Trouble,” “Blank Space,” “Shake It Off,” and “Lover.” ~Despite the setback, Swift has recorded three albums, including “Lover,” “Folklore,” and “Evermore.” Fans and other music lovers can listen to her music on streaming services such as Spotify, Apple Music, or can download them from the iTunes Store."
    },
    {
        "title":"Hanover Street Chophouse: A Pricey But Incredible Meal",
        "image":"https://penmenpress.com/wp-content/uploads/2018/03/chophouse-hp-sunday-dinner.jpg",
        "imageCaption":"(image credit: Hanover Street Chophouse)",
        "category":"LIFESTYLE",
        "author":"Andrew Wilson",
        "date":"October 29, 2021",
        "content":"Fine dining is not usually a staple of the college experience, but from time to time there is the need to have a fancy dinner. Be it an anniversary, a birthday, or even a graduation, the Hanover Street Chophouse is the place to go. As the name implies, it is located on Hanover Street in Manchester, approximately 15 minutes from SNHU’s main campus. ~They offer incredible dishes of steak and fish cuts, along with a robust wine and whiskey menu. Their selection of the appetizers, sides, and main courses is relatively small, but what the menu lacks in quantity is made up for in quality. ~Their bacon-wrapped sea scallops served with their house horseradish mustard is sublime. The maple bacon blending with the salty scallops and the kick of the horseradish mustard make for a wonderful start to the night. Other appetizers include the Colossal Crab Cocktail: crab served with avocado and fritonaise sauce; HSC Meatballs, served with a celery root puree, mushrooms, and grana padana; and Wagyu Beef Carpaccio, served with arugula, Worcestershire aioli, truffle, parmesan, and crostini. ~Their main courses are the real show-stoppers. Most dishes offered are steak, ranging from prime New York sirloin to prime Delmonico. A selection of steak add-ons complete the meal, some of the best being the truffle butter and the bacon maple bourbon jam. The filet mignon with bacon maple jam has a perfect combination of flavors. It cuts like butter and is topped with the rich flavor of the jam. They also have some other house specialties ranging from swordfish steak to chicken parmesan. ~To add to the meal selection, the Hanover Street Chophouse also has a variety of sides to go with the main course. These include roasted mushrooms, baked mac n’ cheese, hand-cut French fries and truffled tater tots. ~The Hanover Street Chophouse also hosts an impressive collection of wines, whiskeys and cocktails. With a full wine cellar beneath the restaurant, there are an overwhelming number of options to choose from. However, the servers are happy to help. Their cocktails are not half bad as well. Their B’s Knees is sweet with a punch, and nobody can go wrong with a classic Old Fashioned. ~Make no mistake, this is fine dining. A meal at the Chophouse will run a pretty penny, with their least expensive steak cut, an 8-ounce filet mignon, costing $42.00. However, when the time comes for an above-average meal for a celebration, the Hanover Street Chophouse is the place to go."
    },
    {
        "title":"SNHU Prepares to “Rock the Night Away”",
        "image":"https://penmenpress.com/wp-content/uploads/2021/10/86B05F92-8A7D-48BD-AA59-E958B6AE8C3E.png",
        "imageCaption":"The RadioSNHU logo (image source: Brendan Mcguire)",
        "category":"ARTS & ENTERTAINMENT",
        "author":"Joshua Dinapoli",
        "date":"November 5, 2021",
        "content":"RadioSNHU will be hosting the “Rock the Night Away” event at the Last Chapter Pub on December 4. This year’s occasion will be bringing in students from the Berklee College of Music in Boston. ~“Rock the Night Away is a night for students to come and enjoy some great live music in the Pub,” said Zachary Davidson, President of RadioSNHU (’22). “This will be a 4-hour event featuring several different genres of music.” ~The collaboration with Berklee will go beyond bringing in musicians. RadioSNHU expects to bring in a sound technician from the college to help with audio mixing. “This means we are going to have really great soul coming from the stage, and everything will be mixed professionally,” said Davidson. ~Davidson also spoke highly of the performers themselves. “They are all top-performing musicians at Berklee, some of whom have sponsorships and endorsements through major bands,” he said. “Many of them have been on tour around the world before.” ~RadioSNHU is the sole sponsor of the event. However, Davidson stated that the club is open to cosponsorships. Additionally, the club has no plans to broadcast it but will consider streaming. ~As the event draws closer to its date, RadioSNHU will make an effort to promote it across campus. Strategies include hanging up flyers and photos. Beyond that, the club has considered producing a promotional reel summarizing the event. ~Since this is not the first time the “Rock the Night Away” event has been held, RadioSNHU wants to ensure it sticks out this year. “We are hiring very talented musicians and sound tech,” Davidson says. “This means the caliber of music coming from our artists, as well as the sound in the Pub, will be on a much more professional level than what we have previously hosted.”"
    },
    {
        "title":"McIninch Gallery Features Artist Nicole Eisenman",
        "image":"https://penmenpress.com/wp-content/uploads/2021/10/thumbnail_Image.jpg",
        "imageCaption":"Nicole Eisenmen’s prints on display (image source: Logan Mock)",
        "category":"ARTS & ENTERTAINMENT",
        "author":"Logan Mock",
        "date":"October 18, 2021",
        "content":"Robert Frost’s McIninch Art Gallery is featuring prints by artist Nicole Eisenman until December 21. There are 17 prints displayed, including “Tea Party,” “12 Heads,” and “Fleet Week.” They can be seen in-person or virtually. Viewers of the virtual exhibition will be able to use the guided tour feature provided. ~The gallery description of Eisenman’s prints says, “Eisenman evokes wit and sentiment to the human condition as a way to dissolve prejudices of individuals who identify in any number of ways…Eisenman employs a mixture of surrealism and expressionism, which reveals the highs and lows of the human experience. The artist creates a complex world of love, melancholy, appetite, spirituality, and desire.” ~Eisenman will also participate in The Portrait: Real and Imagined webinar on November 17 at 5pm. The webinar will focus on their works. Guests will be able to analyze their influences, inspiration, and meanings behind their pieces. ~“[Their art] really speaks to human nature, and I love [it],” said Andrew Chronister (’25). ~Eisenman began as a traditional artist and painter, influenced by classic artists like Pablo Picasso. In 2011, they gave up painting and experimented with their art style. They eventually found an affinity for the medium of print. ~Eiseman’s works have earned them several awards, granting them the MacArthur Fellowship status. The results of Eiseman’s art are often dark and humorous in tone, drawing inspiration from the world around them. ~In an interview after winning the fellowship, Eisenman said, “I think the external world filters into my work, and all the themes are in there because I’m taking everything in.” ~The McIninch Art Gallery’s mission statement for the permanent collection is “to encourage curiosity and applied critical thinking about art and its role in society through curated learning paths and original works of art.” ~Sign-ups for the webinar will be available soon, and updates can be found on the gallery Instagram page @snhu_mcininchartgallery. "
    },
    {
        "title":"Dealing With Burnout",
        "image":"https://penmenpress.com/wp-content/uploads/2021/11/05CBE13B-D9CF-4740-8DAA-A346D3963BAE.jpeg",
        "imageCaption":"Wellness Center (photo source: Taylor Posik)",
        "category":"LIFESTYLE",
        "author":"Taylor Posik",
        "date":"November 4, 2021",
        "content":"With the transition to campus, staff and students have been experiencing burnout over the course of the semester as schedules and workloads have grown. ~“I feel like there’s definitely times where I’m stressed out,” said Olukpe Viakinnou (’25). “I have a lot of work I need to get done and have, like, a lot of extracurricular activities that I have to manage as well.” ~After a year of remote learning, staff and students are having to readjust to life on campus. Because of this, everyone is lacking a sense of normalcy. “Burnout is feeling emotionally, physically, and mentally exhausted,” said Elyse Peredna, Assistant Director of Counseling Services. It is a product of an overabundance of stress that seems impossible to manage. ~People experiencing this will feel unmotivated, be prone to procrastination, and will lose interest in the activities they enjoy. Burnout is created by an overwhelming amount of stress. ~“It’s also this state of just not being invested and not feeling purpose in what we’re doing,” Peredna said. ~After returning to in-person classes, students may be feeling overwhelmed with social pressure. “Over the last year and a half they were behind a screen…There weren’t as many in-person events and meetings,” said Peredna. “Now that they’re back on campus, they’re excited for those things but also they’re just feeling really exhausted by a lot of that, too, so it’s okay to take time for yourself.” ~Practicing self-care can help to prevent the effects of burnout. This can include getting exercise, maintaining a healthy diet, and getting enough sleep. ~Having a daily routine and setting work and social boundaries can give a sense of control. Additionally, taking the time to unplug and participate in activities outside of school and work can be beneficial for a person’s health. ~Students can seek support from their advisor, the Learning Center, or can contact the Wellness Center at 603-645-9679 or wellness@snhu.edu."
    },
    {
        "title":"Cross Campus Construction",
        "image":"https://penmenpress.com/wp-content/uploads/2021/10/Image-2@0.3x.jpg",
        "imageCaption":"Main stairway. (image source: Emily Blais)",
        "category":"NEWS",
        "author":"Andrew Wilson",
        "date":"October 14, 2021",
        "content":"All across the SNHU campus there is caution tape, fences and warning signs surrounding sites under construction. These sites include the SETA (School of Engineering, Technology and Aeronautics) building, Penmen Stadium and the quad stairs on the green space. The work being done on each site varies in scope, but the stairs, most notably, have caused students to have to change their routes or usual patterns around campus. ~The quad stairs are at the heart of campus and are the most direct way to cross the street. The fencing surrounding the stairs on all sides has lead many to wonder what was wrong with them and when they will be fixed. ~“The quad stairs are approaching 10 years old and for the second time in that period, the concrete is failing where the nosing (metal edge protector) is anchored into the concrete,” said Scott Greeb, Assistant Vice President of Facilities Management. “This is caused by many factors including what is used for ice melt, surface treatment, freeze/thaw cycles, etc.” ~This project was planned to run before the pandemic hit but was put on ice when it did. When the freeze on projects was lifted, the stairs restoration was considered high priority and meant to be completed before the start of the fall semester. However, due to an issue with granite suppliers, the project was delayed again. ~“Construction will start as soon as late October and we hope to have it wrapped up in early December, weather permitting,” says Greeb. ~For now, students will have to make do with the walkway to the left of the stairs that leads towards Robert Frost Hall. ~“To leave the stairs open with the failing nosing just isn’t an option we were willing to entertain. The liability to students, staff and faculty would’ve been just too much. Although they look in a safe condition from a distance, the nosing/concrete connection could catastrophically fail at any time and is dangerous to the sheer volume of foot traffic those stairs see,” said Greeb. ~Over at the Stadium, more construction is going on. This includes the field itself, HVAC (Heating, Ventilation, and Air Conditioning), the Americans with Disabilities Act (ADA) compliance issues and more. A leaking problem is the reason the concourse area is taped off as they replace the concrete with pavers. Just recently, some of those sections that were previously cordoned off have been made accessible. ~Meanwhile at SETA, there is scaffolding set up around the building to solve the issue of falling slate from the façade of the building. Over in Robert Frost, students may have noticed the stairs got an upgrade within the first few weeks of classes. They got a face lift, including new carpet on the landings, new stair treads, and a new coat of paint. ~When asked about why there are so many projects happening on campus at once, Greeb stated, “A lot of it is related to the timing of unpausing projects and trying to wrap them up before school started. To pick up momentum with projects after being paused for so long can lose some valuable time. It’s the cost of starting/stopping things. However, we are asking that folks just hang in there while we wrap them up. There was no playbook for the pandemic.”"
    },
    {
        "title":"How to SNHU: Combating Boredom on Campus",
        "image":"https://penmenpress.com/wp-content/uploads/2021/06/82792692_10157888786984347_4306785293651935232_n.jpg",
        "imageCaption":"Inter-Greek Council (image courtesy: SNHU Involvement)",
        "category":"NEWS",
        "author":"Andrew Wilson",
        "date":"September 21, 2021",
        "content":"The fall 2021 semester is in full swing, and with it come new challenges for students. Not only must the first years adjust to campus life, but so too must the sophomores, juniors and seniors after a year of remote learning. While some never got to be on campus, the rest haven’t been on campus in over a year. The return is exciting, however, combating boredom is an important challenge to address. ~Upon returning to campus, there will be many activities for students to participate in. With all of the following suggestions, bear in mind that they may be subject to change with the Covid restrictions that have been placed. ~One of the easiest ways to avoid boredom on campus is to join a club. SNHU has over 75 clubs and organizations to get involved in. The involvement fair will have many of these clubs set up to look at and talk to representatives. It will be taking place on Wednesday, September 8 at 12 pm, according to the SNHU calendar. ~Joining a club can be an easy way to meet new people, entertain oneself and even bolster a resume. Organizations often have weekly meetings, which can help fill out a schedule and prevent too much downtime. ~A good place to find out what’s happening on campus is in the SNHU events calendar, which is accessible on the mySNHU homepage in the top right-hand column. The calendar provides information on events that are happening on campus, including the event’s date, time and location. Students can even sync it up to their Google or Outlook calendar. ~One of the most popular activities is Bingo which is held on Wednesday nights. It is a great way to hang out with people and have some fun. Once a month Big Money Bingo is held where prizes offered often include TVs, air pods and gift cards. ~Students can also look at the calendar to check the schedule of the many campus sports teams. From soccer at Penmen Stadium to field hockey at Larkin Field, and hockey down at the Ice Den Arena, there is a sport for everyone to watch and enjoy. ~In addition, students can hang out in popular places to get to know people. The Last Chapter Pub (the Pub) is a great example of this. Located in the Student Center, the Pub is a place to relax and be entertained. Their Facebook page description states, “We host comedians and musicians also so if you love a good laugh then the pub is your hub! And one of the best parts is you don’t have to drive anywhere! It’s a five minute walk from most places on campus.” ~Besides the Pub, the library is a great place to get homework done or to grab a book to read. If students have some downtime, another spot to interact with people is in the common areas, which are located in every housing building on campus. It is a great place for students to meet new people in their building. ~For students with a car, off-campus locations like Ben and Jerry’s on Elm Street is a popular spot to go to after a hard day’s work. ~Whether a new student or a returning one, there are many activities to get oneself involved in on campus to combat any boredom or isolation."
    },
    {
        "title":"Crime on Campus: The Clery Report",
        "image":"https://penmenpress.com/wp-content/uploads/2021/10/image0.jpg",
        "imageCaption":"Wolak Learning Center. (image source: Joshua DiNapoli)",
        "category":"NEWS",
        "author":"Joshua Dinapoli",
        "date":"October 14, 2021",
        "content":"With the annual Clery report now released, the faculty and students of SNHU now have access to public data that shows the safety profile of the campus. While the data only extends to last year, it provides a trend of how crime has shifted in three years (2018, 2019, 2020). With the advent of the COVID pandemic, there is a clear comparison for how the lower population might have impacted the reported rate of crime incidents. ~The report itself breaks the data down by where the crime occurred. Additionally, it includes any criminal offenses that might have been unfounded. According to the report, there have been no falsely reported crimes in the last three years. ~One of the most notable inferences from the data set is the consistent reports of robbery and motor vehicle theft. In the last three years, there have been no reported cases of these crimes. Another consistent statistic has been the presence of aggravated assaults. Similar to robberies and other theft, this crime has also been nonexistent in the last three recorded years. ~The only theft-related crime reported in the previous three years was burglary. However, there was only a reported incident at a residence hall back in 2018. Since then, there have not been any reported crime incidents of this categorization. ~While some crimes have been consistently nonexistent, others have been counted. Statistically, there were six reported cases of sexual assault in 2018. Over the next year, the rate of reported incidents remained constant. In 2020 the crime rate did drop to only one case; however, interpretation of this statistic must consider the significantly lower student population post-March. ~Other crimes, such as fondling, had a rate as high as seven in 2018 before dropping to only one reported case in 2019 and 2020. ~In addition to recording the number of criminal offenses, the report also keeps track of noted arrests. Broken down further by the type of offense, the categories are liquor law violations, possession or carrying of weapons and drug abuse. Out of the three categories, there has only been one arrest noted due to liquor law violations. While the arrest rate is notably low, the same cannot be said for disciplinary referrals. ~When referrals are taken into account, weapon violations consistently remain at zero. However, drug abuse violations ranged from nine to ten except for 2020 where no referrals occurred. Disciplinary action was the highest for liquor law violations, which reached 200 cases in 2018. Like other categories, these reports declined following the drop in student population. However, even in 2020, the rate was at 21, double the peak of drug abuse violations in 2019. ~For offenses listed under the Violence Against Women Act (VAWA), the report lists the three categories of domestic violence, dating violence and stalking. While there have been no known domestic violence incidents on campus in the last three years, there has been one listed incident of stalking each year since 2018. ~Reports of dating violence fluctuated over the three years from four cases during 2018, dipping to none in 2019, before rising back to two cases in 2020. Finally, any reported hate crimes are listed, for which there have been none in the last three years."
    },
    {
        "title":"How to SNHU: Time Management",
        "image":"https://penmenpress.com/wp-content/uploads/2021/08/How-to-Manage-Work-and-School.jpg",
        "imageCaption":"(image courtesy: Breeze)",
        "category":"LIFESTYLE",
        "author":"Christopher Kelly",
        "date":"September 21, 2021",
        "content":"Moving onto a college campus involves a lot of change simultaneously. Therefore, it’s important to remember time management. ~Students should remember there are only so many hours in a day and they should leave time for themselves. ~One way to accomplish this is to treat assignments like projects by starting them early and chipping away at them over time. This strategy will keep assignments from piling up and reduce stress to the college experience, which will help avoid late nights and missing sleep. ~Another strategy students can use to ensure they leave time for themselves is to write down assignment due dates and time commitments. This will help students track their time so they don’t fill up their schedule. ~For new students, time management in college can be a difficult change from high school. When asked about the differences between high school and college, Evy Hill (’23) said it was the amount of reliability. ~“Going online made it very difficult to balance everything going on in the world around me,” said Hill. “Writing it down on paper and visually seeing it made me keep better time schedules.” ~If students have trouble with assignments, there are plenty of resources to help them. Teachers have office hours to answer questions and provide help on assignments. Classmates are another resource students can use to set up study groups or ask for help with assignments. ~The Shapiro Library also offers tutoring services and workshops for anyone. Another service offered by the library is the Chat 24/7 with a Librarian link to answer any questions by students and to help find any necessary information. Study rooms are also available to provide a quiet space to complete assignments or work on team projects. ~With the Covid-19 guidelines being enacted on SNHU campus, there is concern about the availability of resources at the Shapiro Library. When asked if there would be services available in the fall, Heather Walker-White, Manager of Library Information Services, said that study rooms would be available for students to use. ~“At this time, we plan to re-open the Wolak Learning Center (WLC) on Monday, August 16, with limited summer hours until fall classes resume at the end of August,” Walker-White said. “The study room reservations calendar will reflect available times beginning August 16, and fall semester hours will begin Sunday, August 29.” ~There are seven group study rooms and a screening room for all students to use. To reserve a room, go to the library homepage, click the reserve a study room option (third from the bottom in Quick Links) and choose a time. As long as the reservation is confirmed within four hours, the study room will be reserved. SNHU provides many resources to help with time management of all kinds so students can work with confidence."
    },
    {
        "title":"Baby Keem Takes Rap Scene by Storm With Powerful Debut",
        "image":"https://penmenpress.com/wp-content/uploads/2021/10/baby-keem-hooligan-ones-to-watch_1600669628.jpg",
        "imageCaption":"Baby Keem drops two new singles. (image source: onestowatch.com)",
        "category":"ARTS & ENTERTAINMENT",
        "author":"Stefan Karlberg",
        "date":"October 12, 2021",
        "content":"Los Angeles-based rapper Baby Keem made it clear that he deserves to be in the conversation for best rapper of the year since the release of his debut studio album, “The Melodic Blue.” ~Baby Keem isn’t brand new to the music scene. His 2019 song, “ORANGE SODA,” brought his first taste of virality and has more than 2 million plays on Spotify. Mostly known for making faster-tempo songs such as “STATS,” “MOSHPIT,” and the self-titled “BABY KEEM,” Keem expands his sound in “The Melodic Blue.” ~The album was preceded by singles “hooligan,” “no sense,” “durag activity” and “family ties,” with the latter featuring 13-time Grammy Award winner Kendrick Lamar. Lamar, Keem’s cousin, also owns pgLang, the record label behind “The Melodic Blue.” ~Some critics have suggested that nepotism is behind the emergence of Baby Keem’s stardom, but he ignored the critics and dropped one of the most popular singles of this year. “Family ties” has already accrued 71 million streams almost two months after it was released, with thanks to TikTok virality. ~While “family ties” shares the upbeat sound Baby Keem has used so well, the complex instrumental and beat-switch are indictive of “The Melodic Blue’s” exploration of sound. From the first track, “trademark usa,” it is clear that “The Melodic Blue” is a new direction for Baby Keem. The samples in “pink panties” and “scapegoat” show a growth in beat production, which Keem was less involved in with his previous projects. ~Baby Keem still keeps bangers as a corner piece of this project, but he also experiments with slower and more intimate selections. “Issues,” “south africa” and “gorgeous” all feature a new sound. Baby Keem gives the listener a new view into his personal life; the line, “I can’t go ghost, I face demons/Don’t let it defeat you, all in my hands/I know it’s hard for you to come out that trance/I look myself in the mirror when I can,” from “issues” shows a more intimate view of Baby Keem beyond his stage persona. ~“The Melodic Blue” takes the audience for a ride unlike any other Baby Keem project. He supplies his iconic hard-hitting songs, but adds a new experience with his slow, introspective rap. Baby Keem will be performing in Boston on November 21 at the Paradise Rock Club."
    },
    {
        "title":"Men’s Cross Country Crosses the Finish Line",
        "image":"https://penmenpress.com/wp-content/uploads/2021/11/cross-country2.jpg",
        "imageCaption": "Cross country runners competing at the Shacklette Invite (image courtesy: Jim Stankiewicz)",
        "category": "SPORTS",
        "author":"Adam Dufault",
        "date":"November 19, 2021",
        "content":"After competing in regionals at Roberts Wesleyan College in Rochester, New York the weekend of November 6, the men’s cross country team hung up their spikes, tying the knot on the 2021 season. ~The team finished 15th of 21 at a regional cross country race which took countless miles and hours to accomplish. Mastering a comfortable running pace is something that is worked on year-round and takes a great deal of time, but SNHU cross country has done it. ~SNHU veteran runners JT Gulick (‘23) and Liam Walker (‘23) spoke on what this season was like, and the preparation it entailed. ~Gulick worked his way to the second-fastest on the team before injuring his Achilles early in the season. He described the team dynamic, stating that he believes most of the team is very similar in skill, and that there is a significant comradery between the runners. ~“There’s a chunk of us that’s all within 10 to 15 seconds of each other,” said Gulick. ~Whether at practice or in race, the team prefers to stick together as a collective group. It’s not uncommon that students at SNHU see the team running around campus to practice. However, their routes are much more complex than meets the eye. “We run into [Manchester], and Hooksett, too. ~We have a five-mile loop, eight-mile loop, seven-mile loop, twelve-mile loop, and a fifteen-mile loop,” said Gulick. It is a whole lot more than simply running from one residence hall to another. Students may not be aware of all the running that the team does. ~When asked about what the season was like for him, Walker noted the work ethic that is required to do well in such a sport. “It definitely starts early on. We’re training all summer long… I got up to 70 miles per week,” said Walker. ~With the team competing at regionals, the pressure was on. “I think it was one of our better performances of the year… Our goal was to kind of have a close spread between each other,” said Walker. ~“This was kind of like a building year for us,” said Walker. With hope and determination for what the future holds, Gulick continued, “We’ll come back next year.”"
    },
    {
        "title":"How To SNHU: Communicating With Professors",
        "image":"https://penmenpress.com/wp-content/uploads/2021/06/istockphoto-1093522584-612x612-1.jpg",
        "imageCaption":"Communicating with professors (image courtesy: iStock)",
        "category":"LIFESTYLE",
        "author":"Jon Boroshok",
        "date":"September 21, 2021",
        "content":"Connecting with professors, advisors and administrators is never as complicated as it seems, and they’re all here to help you if you let them. Understanding a few simple “ground rules” can help build relationships and effective communication. For example: ~All professors have office hours, and many post those on their office doors. Don’t be afraid to visit them in person. Introduce yourself on a first and last name basis so they’ll know who you are. Have your student ID card with you in case you want help with your academic program. ~Speaking with them in person is the best way to communicate. If they see you willing to make that effort, they’re more likely to go the extra mile for you too. If a class you want is full, go ask the professor directly. It’s harder to turn down students who care enough to look you in the eye. ~Once professors get to know you, they can help you make contacts and be part of their network. This can open up new opportunities to learn, do internships, and find jobs. For many professors, that’s the most rewarding part of the job. Let yourself benefit from it! ~Remember that professors are people too. They work here. Try reaching out to them during normal business hours rather than at night or on weekends. ~Most professors believe that being a student is your full-time job. While many understand that you also work part-time, have internships, or are involved in other activities or athletics, they expect schoolwork to come first. Help them believe this about you! ~Don’t miss classes. If you have an 11 a.m. class, be in your seat, with your phone out of sight by 11. Don’t be that student who strolls in at 11:02 a.m. because there was a line for the coffee that’s still in your hand. Professors see that as a sign of disrespect or not caring about class. ~If you can’t get to their office hours, that’s okay. Professors check their SNHU email regularly. Until you get to know them, address them formally, such as “Dear Professor Smith.” Remember that it’s a business email, not a text to your friend. Try to send emails during business hours. ~Check your SNHU email at least twice a day, every day. That’s how professors and the school will communicate with you. Sorry – we don’t text or Snapchat. ~If you have a problem with a class, see that professor first. Most are open to discussion, and want to work with you. Being proactive helps earn their respect, and is more likely to lead to a happy resolution. If that doesn’t help, see your Academic Advisor, or the Department Chair. ~Above all remember, we here to help you. Welcome to the Fall 2021 semester!"
    },
    {
        "title":"Natalie Kallmunzerova Rallies for NE-10 Player of the Year Award",
        "image":"https://penmenpress.com/wp-content/uploads/2021/10/natalie.jpg",
        "imageCaption":"Natalie Kallmunzerova at SNHU women’s tennis photo day (image courtesy: Jim Stankiewicz)",
        "category":"SPORTS",
        "author":"Adam Dufault",
        "date":"November 3, 2021",
        "content":"SNHU graduate student and tennis standout Natalie Kallmunzerova (’22) earned her third NE-10 Player of the Week honor of the season. This was following the week of Oct 10 before being named NE-10 Player of the Year on Oct 21. ~Coming from Prague, Czech Republic, Kallmunzerova and other international teammates are diversifying SNHU’s tennis roster. Now, she stands atop her competitors with a 16-0 record in a singles play with a trip to the The Intercollegiate Tennis Association (ITA) Nationals in Rome, Georgia. ~When asked about his player’s success, 16-year tennis coach Gregory Coache had nothing but high praise toward the undefeated Kallmunzerova. “She likes working hard. Every practice she takes very serious….If she’s not hitting well in practice, she asks for additional hitting. Sometimes we say we’re coming to an end, but she asks for a little bit more….There’s not a coach out there that wouldn’t love that,” said Coache. ~Before coming to SNHU, Kallmunzerova first left the Czech Republic to study and play tennis at Florida Atlantic University. Coache was referred to her by Magdalena Hubickova (’23), a fellow SNHU tennis player from the Czech Republic. The two were teammates back home and haven’t missed a beat in their time apart. ~It takes a win-or-go-home mentality to find the success Kallmunzerova has found. “If something goes wrong, [she’s] going to work hard to make it better. She doesn’t get discouraged, she gets more motivated,” said Coache. “I’ve had…five or six amazing girls that have come through our system that really dominated…and Natalie is right at the top.” ~Joining the SNHU tennis program was a huge step in Kallmunzerova’s career. First, she left her home country for the opportunity to study and play at the same time. Then, she transferred to SNHU from Florida Atlantic University to prolong her academic and athletic careers. ~“If it’s practice or a match…giving 100% maximum effort is the key if you want to succeed, no matter if it’s sport or professional life,” said Kallmunzerova. ~She spoke on her time at the national tournament in Georgia, which took place the week of October 11. “It was a little bit different…I got used to being surrounded by my teammates, which gives me confidence,” said Kallmunzerova.  ~While she was individually winning her matches, she understands that a team is like a family. ~To qualify for nationals, she had to earn her spot as the single NE-10 qualifying player at the regional tournament in New York, which was no easy task. “Four days full of tennis. We ended up playing four matches per day. So, after, I was exhausted….It was physically and mentally very tough,” said Kallmunzerova. ~Accolades are coming in from all directions for the Czech tennis player. “It’s kind of like a satisfaction for your hard work,” said Kallmunzerova. “I don’t like talking about my past successes… I feel like the future is what’s important.”"
    },
    {
        "title":"Men’s Golf Looking Forward to Spring Regionals After Successful Fall Season",
        "image":"https://penmenpress.com/wp-content/uploads/2021/10/Golf-Picture.png",
        "imageCaption":"Matt Conti (’22) marks his ball during the Franklin Pierce Fall Invitational (image courtesy: Jim Stankiewicz)",
        "category":"SPORTS",
        "author":"Chris Tutt",
        "date":"October 29, 2021",
        "content":"The SNHU men’s golf team had a season to remember this fall. Taking first place in three of their five matches, it’s safe to say this team is going into the spring with vigor. ~The team of eight has confidence, with each member a strong player. Five of the eight are selected to go to tournaments. ~“Our biggest strength is that any one of the five [who go to matches] can win the tournament,” said golfer AJ Cavotta (’24). ~Cavotta, the reigning NE-10 player of the week, is satisfied with the team that he is a part of this season. ~“Our team is very good this year,” said Cavotta. “It’s a good group of guys who like each other. We had five tournaments and four individual winners; we have a lot of depth. We’re going to be even better in the spring.” ~The team took third place at the NE-10 tournament, but senior captain Matt Conti (’22) believes that his team can only go up from here. ~“We’ve had some underclassmen step up,” said Conti. “We are definitely happy with the expectations that we had set. We are confident going into regionals and, hopefully, nationals.” ~With conference play finished for the year, the team has new goals going into the spring. ~“First, we have to win regionals; that’s our goal right now,” said Cavotta. “If we win regionals, we’ll go to nationals. We’re just taking it one step at a time.” ~While it is clear that the golf team is solid on the course, Conti believes that it’s what happens off the course that has led to success. ~“Our team chemistry is really good…It helps because every player wants each other to do well,” said Conti. ~Living in New England presents many obstacles for golfers. With playing outside being nearly impossible over the winter, these Penmen need to adapt and find ways to keep their game sharp for the spring. ~“I’ll mostly play indoor golf…My swing coach back home [in Saratoga Springs, NY] has simulators, so I’ll practice with him. It’s not even close to being actual golf, but I will make the most of it,” said Cavotta. ~Going forward, every aspect of the team’s game is going to be tested. Conti, being a leader and veteran of this team, has an important message that he wants his team to keep in mind. ~“Keep it up,” Conti said. “We have been putting in a lot of work and I know that it will pay off when the time comes.”"
    },
    {
        "title":"Not Your Average “Aussie”",
        "image":"https://penmenpress.com/wp-content/uploads/2021/10/IMG_5041.jpg",
        "imageCaption":"Trevor Turmel (’23) spending time in Florence, Italy in 2019 (image courtesy: Trevor Turmel)",
        "category":"LIFESTYLE",
        "author":"Adam Dufault",
        "date":"October 27, 2021",
        "content":"At the start of his freshman year, Trevor Turmel (’23) decided to create a new identity. He stepped into class on the first day of school with a heavy Australian accent. For two years, Turmel put up the façade of a foreigner before all of his SNHU peers. ~The purpose of his social experiment was to create inclusivity and get to know people. Turmel did it not to elicit attention, but to observe how people act when around someone of different qualities. ~“I noticed that not a lot of people would communicate with me, or thought I was interesting…I thought, ‘What if I changed the way I talk?'” Turmel said. “For the past two years, I’ve been putting on different accents from around the world….A lot more people are actually communicating with me more just because of the way I talk.” ~Turmel envisioned college to be a place of interaction, but it wasn’t as he thought it would be. “I work in a hotel, so I work with people that are from different countries, from all over the world,” said Turmel. “Immediately, if they hand me a passport from a different country or speak a different language, I always ask them, ‘Where are you from?’ or, ‘What language are you speaking?’”   ~At first glance, Turmel is a normal college student studying for classes and doing homework. What his peers didn’t know was that he was conducting research on how to be Australian and how to capture the role he wished to portray. ~“I actually did a lot of research on not only the accent itself, but also the culture of Australia….I looked up how a childhood in Australia is different from a childhood in the US,” said Turmel. ~Turmel decided to call it quits after two years of living two different lives. Living two lives took a mental and emotional toll on him.  ~“For a while I was actually considering going to a psychologist about this situation…I knew if I continued doing this, I was going to develop my own form of imposter syndrome,” said Turmel. “I realized that if I didn’t have the accent, I don’t think my self esteem or my outgoing nature would have been as strong.” ~Imposter syndrome can be described as a lack of confidence to play the role of yourself. “I felt like I didn’t have…good self-esteem…because I didn’t think I was interesting enough. I didn’t think people would find me interesting,” said Turmel. ~Now that he’s finally coming clean after two years of using an accent, Turmel had some closing words for how he wants people to view this illusion. ~“I know people will feel indifferent about it,” said Turmel. “I know there are some people who live on campus who are from these countries that I’ve been portraying, but I want them to know I wasn’t trying to offend them…I can’t change how people think about it…I’ve come to terms with that.” ~Turmel knew his plan wouldn’t always work, but he wants people to know this was merely an experiment that he could have gone without doing.  ~“I want people to understand that even though you might not think that you’re interesting…there are going to be those people that go out of their way to make sure that you’re included,” said Turmel. “Embrace yourself, and let people know who you really are.”"
    },
    {
        "title":"Debt Relief, Grants And Free Community College",
        "image":"https://penmenpress.com/wp-content/uploads/2021/02/Joebideneducation.png",
        "imageCaption":"President Joe Biden’s Education Plan (image courtesy: joebiden.com)",
        "category":"LIFESTYLE",
        "author":"Elizabeth Lemieux",
        "date":"February 17, 2021",
        "content":"The Biden Administration has settled into the Capitol and college students, prospective students and alumni across the country wait for the roll-out of President Joe Biden’s higher education plan. ~President Biden was sworn into office on January 20. He previously laid out his plan for higher education on his campaign website and has been vocal about his aspirations to improve the American education system. ~In his plan, Biden focuses on reforming the student loan repayment process and making college more affordable for low-income families. ~If approved, the Biden Administration will cut payments on undergraduate federal student loans in half. Alumni will only have to pay 5% of their income “minus taxes and essential spending,” according to joebiden.com. Their payments won’t be taxed, and after 20 years of paying student loans responsibly, their federal debt will be forgiven in its entirety. ~Not all alumni will be required to pay their student loans. Those who make $25,000 or less a year will not owe or accrue interest on their undergrad federal student loans until their annual income grows. This would take the pressure off alumni and future graduates to repay their loans when they can’t afford them. ~Miguel Cardona, the Department of Education Secretary nominee for the Biden Administration, has stated that he supports Biden’s plans and aims to prioritize student loan forgiveness and student debt in America. ~“[I will] work with our Senators and our Congress folks to support a plan that provides some relief to our students in higher education,” Cardona said in an interview with Connecticut Public Radio. ~In addition to reforming the federal student loan repayment process, the Biden Administration plans to make college more affordable for low-income and minority families. ~If approved, Biden will double the value of the Pell Grant, a grant specifically made for those who need financial aid the most. He also wants to support minority-serving institutions by building research labs and abolishing inequalities in funding, says joebiden.com. By doing this, the Biden Administration aims to make attendance and graduation from college a more equitable experience for all students. ~Biden also aims to make public colleges tuition-free for families who make less than $125,000 a year. This policy stems from Bernie Sanders’ and Pramila Jayapal’s proposed 2019 College for All Act. It is estimated that millions of people would be able to continue their education if this notion is put into place. ~It is likely that not every aspect of these plans will come to pass. Each policy requires a big budget and may have difficulty receiving bipartisan support. For example, Biden’s free-tuition policy may not come to fruition as it’s highly debated and lacks bipartisan support. However, his plan to increase the value of the Pell Grant is more likely to pass because it has received support from both parties, as well as backing from over 80 educational organizations."
    },
    {
        "title":"Know Your Community: New Castle",
        "image":"https://penmenpress.com/wp-content/uploads/2019/04/2048-1024x642.jpg",
        "imageCaption":"New Castle Hall",
        "category":"OPINION",
        "author":"Robbie McCluskey",
        "date":"April 13, 2019",
        "content":"Only one building on campus can properly exemplify the environment first-year students should find themselves in when they first live on campus. It’s one building that takes all hopes for a luxurious lifestyle and tosses them in the Merrimack. One building so bland, that the color grey would say it looks dull. A building that couldn’t even escape a name that bore the burden of inevitable irony. New Castle. ~Anyone who has lived or passed by there will recognize that New Castle is neither new nor a castle. In fact, it would be more comparable to a castle’s servants’ quarters. ~The exterior of the building will have those living in denial saying, “It’s what’s on the inside that counts,” and that is a completely reasonable and true statement. The inside, however, fails to raise the bar that was set rather low by the exterior. The design and materials used on the interior of New Castle instill a feeling of nostalgia for walking through the halls of a middle school circa 2006. ~The rooms are about the size of the walk-in closet everyone dreams of having one day, and taking up a good chunk of space in those rooms are beds that will have you sleeping two comfortable feet off the ground; perhaps a metaphorical representation of how first-year students are now building their future from the ground up. Deeper meaning or not, the beds eliminate loads of potential storage space offered by beds that can be raised. ~New Castle is also the only residence hall that helps you fight off the freshman 15. Those living on the fourth floor will need to develop a tolerable relationship with stairs as the elevator is only accessible with a special key. If there were ever the need for an indication of what generation the building was originally catering to, that would be it. ~Even so, New Castle has the most personality on campus. ~At a time when SNHU’s bank accounts looked like Smaug’s resting chamber, massive construction and renovation projects were creating a new, modern environment around campus. The result was a school where every student had a nice, relatively modern place to live. This sounds great on paper and even out loud, but what are the developmental implications of such a change? ~Adversity breeds creativity and those who explore the halls of New Castle will see levels of creativity unmatched in any other residence hall. The magic of New Castle lies with its residents and their impressive ability to take a blank, dated and arguably cramped canvas, and paint a masterpiece of socialization and personalization. ~When creating a home and community out of New Castle, the residents do much more with much less than other students. They aren’t given modern kitchen equipment, there are no pretty LEDs making the building look like the inside of a gaming student’s desktop, and there won’t be any amazing parties thrown there, but it’s bursting with personality from a young, energetic and social community of people. ~As more of the old campus gets torn down and changed, SNHU loses more places like New Castle where luxury was a foreign concept, but personality and fun to be had were generously supplied. ~Having once looked out at the social hub of campus with Greeley, Whittier, and the old quad, New Castle now stands alone in its own corner of the Westside like the last person to die or move out of a once close-knit community. ~Perhaps it is the result of growing up in a time when children’s programs aggressively personified inanimate objects, but when looking at New Castle, it’s difficult to see it as anything other than a lone individual caught in between two generations. ~New Castle is no Kingston. It’s not even a Tuckerman, as these halls are Disney World compared to New Castle which resembles Woodstock. They may be more modern and organized, but everyone knows where the better time is to be had."
    },
    {
        "title":"Why SNHU Should Reopen In The Fall",
        "image":"https://penmenpress.com/wp-content/uploads/2021/02/MSC_264-3.jpg",
        "imageCaption":"SNHU branded bike rack (image courtesy: SNHU External Affairs and Communications)",
        "category":"OPINION",
        "author":"Shubham Oza",
        "date":"February 3, 2021",
        "content":"When SNHU shut down all non-essential campus activity in March of 2020, it shifted its gears toward a more accessible online learning environment for on-campus students. ~This shift sparked widespread adoption of digital platforms like RingCentral, Zoom, and Microsoft Teams as the primary means of delivering education. ~Now, as the university approaches its one-year anniversary of adopting virtual learning for its on-campus community, the discussion of when it would be appropriate to reopen the campus remains at large. ~While both proponents and critics diverge on the argument to varying degrees, the key to solving this problem is not to combat another virtual semester, but rather to resume normal campus activities in the fall for optimal student and faculty health. ~In fact, a growing number of concerns from the SNHU student body strongly suggest that the long-term effects of online learning are more detrimental than beneficial to student and faculty well-being. Transitioning to virtual classes has been, “a lot different than I thought it was going to be,” explains Luke Zemianek, a second-semester innovation scholar majoring in sports management at SNHU. ~“We [innovation scholars] don’t have scheduled class times, so we have to do the work for the week by ourselves,” he adds. ~As a strong visual learner, Zemianek believes that his professors’ weekly class assignments have been taking a serious toll on his greater motivation to continue learning. For him, effective digital communication regarding his studies or, “having your teacher meeting with you once a week would be helpful,” but he has not, “met anybody yet, and that’s definitely one of the reasons why being off-campus is tough.” ~Similarly, on-campus educators at SNHU have found it equally as challenging to teach classes that are both engaging and interactive for their students in a remote academic environment. ~Like the professors at the School of Arts and Sciences have been struggling significantly for the past year to modify common course content to fit online academic settings, especially coursework that deals with lab experiments. ~When chemistry students perform hands-on experiments at home, “sometimes roommates knock over their [the students’] items, other times they run out of materials, and sometimes their moms need the kitchen for cooking,” details Jessica Burl, a chemistry instructor and science lab administrator at SNHU. ~In Burl’s case, lab courses have not been the same since academic classwork has become virtual. “We’ve lost all that connectedness,” she explains, “and sometimes it just feels like I’m talking,” instead of lecturing a class of college students. For lab professors like her, it is upsetting because, “lots of students are afraid to speak up,” and, “they just try to pass – not get that A.” ~Having witnessed students and faculty battle academic hardships over the past 2 semesters, Burl sees returning to campus in the fall as the most rational option. Her excitement would be through the roof and, “nothing would make me worried,” she exclaims. “Even if the virus is still rampant, we can wear masks,” Burl states, “and I hope the vaccine becomes available soon, so more of us can be vaccinated.” ~For staff and students, not only does returning to an educationally driven, in-person learning environment sustain mental and physical well-being, but it also enhances the academic performance of the student, by promoting general efficacy in instructor communication. ~Provided that SNHU upholds strict obedience towards COVID-19 safety guidelines, it seems clear that the most beneficial action that SNHU can make for its faculty, staff, and students is to reopen its gates during the fall semester of 2021."
    },
    {
        "title":"How the Winter Class Cancellation Policy Affects Commuters",
        "image":"https://penmenpress.com/wp-content/uploads/2019/02/carstuck.jpg",
        "imageCaption":"Car Stuck In Snow (Red Plum)",
        "category":"OPINION",
        "author":"Spencer Fennell",
        "date":"March 27, 2019",
        "content":"During the bitter winter months, students pray for snowfall in hopes of class cancellations. For some students, even the smallest amount of snowfall can get them excited for a snow day. However, not too many people know the process the university goes through to cancel classes due to snow. ~The Penmen Press spoke with the individual responsible for making this hefty decision: Associate Vice President of Academic Affairs, Jeremy Owens ~Owens’ process to cancel classes follows a relatively standard procedure. He looks at other cancellations, the intensity of the storm, and whether the cancellation will interfere with important events happening on campus, such as finals. ~The main factor in determining whether to cancel classes, he said, is the amount of expected snowfall. ~“Heavy snowfall is usually when we cancel. It’s rare that we cancel for anything else,” said Owens. ~On the contrary, low levels of snow produce slicker and icier roads, which makes traveling to and from campus more difficult for commuters. Yet, as Owens stated, it is uncommon for the university to cancel classes when the snowfall is light. ~The roads are especially dangerous at night or early morning when most commuters are driving to and from campus. Ice covers the pavement the most at these times, and commuters often cannot even see this ice. ~Facilities sprinkle salt on all campus roadways, but students commuting from far lengths throughout the Greater Manchester area are not as fortunate. The roads many students drive on are not always salted, causing an uneasy, stressful commute. ~Facilities work tirelessly through the wee hours of the night to ensure all walkways and stairwells around campus are plowed. They take every precaution necessary so on-campus can attend their classes. Yet, commuters are late to class because they slid off the road because the road was not plowed or salted. It almost seems like SNHU cares more about its on-campus students than commuters when it comes to winter weather precautions. ~Approximately half of all SNHU students are commuters, and if the roads are in dangerous conditions, they shouldn’t be forced to attend class. Just because the snowfall isn’t exactly “heavy,” it still impacts students’ commute. Therefore, SNHU should take commuters into consideration when canceling classes."
    },
    {
        "title":"It’s Alarming You Leave Lint in the Dryers",
        "image":"https://penmenpress.com/wp-content/uploads/2019/02/IMG_5312-1210x642.jpg",
        "imageCaption":"",
        "category":"OPINION",
        "author":"Catherine Lachance",
        "date":"March 25, 2019",
        "content":"Last Sunday night, I laid peacefully in my bed in Windsor Hall engulfed in pillows and blankets. I had been running around so much all week. When I finally accomplished all my assignments that night, I jumped into bed to relax. I finally had “me time.” ~Then I was faced with my biggest stressor: the screeching sound of the Windsor fire alarm. ~I jumped out of my bed as fast as I could. My body shook and my heart raced. Discombobulated, I scrambled to grab my coat and shoes before evacuating the building with my pod mate. ~Together, my pod mate and I walked down to her car in the basketball court parking lot. While we sat in her car to avoid the cold, we watched two fire trucks, several public safety vans and an ambulance pull up to the main entrance of the building. ~The two of us pondered what the possible cause of this fire was. Was it just a drill? Did someone leave popcorn in the microwave for too long? Did someone carelessly “forget” to put water in microwaveable mac-and-cheese? Or, the lamest of them all, did some imbecile light up in their room? ~We sat in her car for about 20 minutes watching Public Safety officers and firefighters enter and leave the building. Then we decided to brave the frigid temperatures and trek up the hill to Windsor. As we approached the building, the fire trucks and ambulance slowly left the entrance. ~A Public Safety officer stood outside the entrance directing students back into the building. Curious for answers, my roommate and I asked her what the cause of the alarm was. The officer’s answer was startling. Some nincompoop neglected to clean the lint out of the dryer in the laundry room. ~You should never leave lint in the dryer. I thought this was common sense. Leaving lint in the lint tray is a fire hazard, and in case you didn’t notice, there is a sign above the Windsor dryers explicitly explaining how to properly use them, with the first step being “remove all lint from the lint tray.” ~According to the National Fire Protection Association, firefighters respond to around 14,630 fires a year that are caused by dryers. One-third of those fires are caused by an accumulation of lint. Having too much lint in the lint trap can set you up for a dangerous situation. ~With that in mind, how can you be so careless to leave lint in the dryer? Even though it may not seem like it, leaving lint in dryers is dangerous. Please remove it before you start the dryer. It’s a simple, yet necessary, step in the drying process and it will prevent setting a building on fire. ~It’s infuriating to me to watch the foolishness of a shortsighted individual neglect to remove lint from a dryer. It takes less than a second to do, as opposed to 25 minutes outside in the cold waiting for the “OK” from Public Safety. I don’t think it’s too much to ask. ~Thankfully, no one was hurt in Windsor when this incident occurred. However, it disrupted many people’s evenings, including mine. But, it should serve as a wake-up call for all residents on SNHU’s campus to remove lint from dryers to prevent anything more serious from happening. ~If you are looking for a good read tonight, look above the dryers."
    }
]