[
    {
        "title":"Dining Hall Disaster",
        "preview":"",
        "image":"Dining-Hall-Disaster",
        "imageCaption":"A Dining Hall chicken sandwich served with mold (image courtesy: Calie Wilbar)",
        "category":"NEWS",
        "author":"Lillian Nelson",
        "date":"November 5, 2021",
        "content":"Students have recently noticed some issues in the dining hall with long lines, food quality and moldy products. Sodexo responded to the complaints in an interview with Sodexo’s General Manager, Daniel VanAvery. As seen on social media platforms such as the SNHU Barstool Instagram, students have reported receiving moldy bread, salad with plastic in it, uncooked steak, uncooked chicken, and rubber bands around broccoli. “It was a mistake. I think we got it all squared away. For a week it happened regularly,” said VanAvery when asked about the moldy bread. VanAvery explained that some deliveries were marked with the wrong dates when shipped at the beginning of the semester. The Sodexo team uses the same method of putting out food as grocery stores do; food expiring sooner goes to the front and food expiring later goes to the back. Thinking the bread was only one day old, as it was labeled, it was brought to the front. In reality it was three days old and was served to some students. VanAvery also commented when asked about students finding rubber bands around their stalks of vegetables. He said Sodexo struggled with staffing throughout the pandemic and his staff is “working back-to-back shifts” and putting in long hours at the dining hall, so a couple meals were missed in production and served to students. Longer lines have also been a problem in the dining hall, even longer than in previous years on campus. When asked about the matter VanAvery said, “70 percent of their staff is new….We had 50 job openings, staff retired and then the pandemic happened.” Sodexo staff is working long shifts to get through the nearly 30,000 transactions in just a week. With new staff needing to be trained and other staff needing to be in different areas in the kitchen, the lines got longer. Staff shortages and delivery issues caused a stir in the dining hall since returning to campus. “It was a mistake….It’s not okay. At no point is it okay and…of course, it’s not [Sodexo’s] standard. Our goal is always to serve the best food. Good food every day,” said VanAvery."
    },
    {
        "title":"Time to “Begin Again” With the Release of Taylor’s Version Albums",
        "preview":"",
        "image":"tswift",
        "imageCaption":"Taylor Swift’s “Red” Album (image source: Taylor Posik)",
        "category":"ARTS & ENTERTAINMENT",
        "author":"Taylor Posik",
        "date":"November 3, 2021",
        "content":"Singer-songwriter Taylor Swift is set to release her album, “Red (Taylor’s Version),” on November 12. It will include all of the songs from her “Red” album (2012) along with an extended 10-minute song and unheard selections from the vault. Tracks from the vault will feature Chris Stapleton, Phoebe Bridgers, Mark Foster, and Ed Sheeran. “I can’t wait til we can dust off our highest hopes and relive these memories together. We’ll also be making a bunch of new ones, too,” Swift said in a social media post. Since the beginning of 2021, Swift has been working on releasing all her previous albums re-recorded. “Fearless (Taylor’s Version),” was released in April and has risen to the number one spot on The Rolling Stones Top 200 Album Chart, according to Rolling Stones Director of Charts, Emily Blake. Swift also released a re-recorded single from her “1989” album, “Wildest Dreams” in September. Next in the music lineup will be the release of more Taylor’s Version albums, including “Red,” “Speak Now,” “1989,” and “Reputation.” However, Swift will have to wait until 2022 for the latter due to the contract with the previous record label, Big Machine Records. Controversy sparked after the artist left Big Machine Records and signed onto Republic Records and Universal Music Group in 2018. In an article explaining why she is re-recording her album, journalist Jessica Sager wrote in Parade, “Swift would later reveal that she attempted to negotiate with Big Machine to gain ownership of the masters of her first six albums but was turned down.” This included her not being allowed to perform her old songs at the 2019 AMAs after winning Artist of the Decade. However, the artist was able to perform her original setlist, including the following titles: “The Man,” “Love Story,” “I Knew You Were Trouble,” “Blank Space,” “Shake It Off,” and “Lover.” Despite the setback, Swift has recorded three albums, including “Lover,” “Folklore,” and “Evermore.” Fans and other music lovers can listen to her music on streaming services such as Spotify, Apple Music, or can download them from the iTunes Store."
    },
    {
        "title":"Hanover Street Chophouse: A Pricey But Incredible Meal",
        "preview":"",
        "image":"steak",
        "imageCaption":"(image credit: Hanover Street Chophouse)",
        "category":"LIFESTYLE",
        "author":"Andrew Wilson",
        "date":"October 29, 2021",
        "content":"Fine dining is not usually a staple of the college experience, but from time to time there is the need to have a fancy dinner. Be it an anniversary, a birthday, or even a graduation, the Hanover Street Chophouse is the place to go. As the name implies, it is located on Hanover Street in Manchester, approximately 15 minutes from SNHU’s main campus. They offer incredible dishes of steak and fish cuts, along with a robust wine and whiskey menu. Their selection of the appetizers, sides, and main courses is relatively small, but what the menu lacks in quantity is made up for in quality. Their bacon-wrapped sea scallops served with their house horseradish mustard is sublime. The maple bacon blending with the salty scallops and the kick of the horseradish mustard make for a wonderful start to the night. Other appetizers include the Colossal Crab Cocktail: crab served with avocado and fritonaise sauce; HSC Meatballs, served with a celery root puree, mushrooms, and grana padana; and Wagyu Beef Carpaccio, served with arugula, Worcestershire aioli, truffle, parmesan, and crostini. Their main courses are the real show-stoppers. Most dishes offered are steak, ranging from prime New York sirloin to prime Delmonico. A selection of steak add-ons complete the meal, some of the best being the truffle butter and the bacon maple bourbon jam. The filet mignon with bacon maple jam has a perfect combination of flavors. It cuts like butter and is topped with the rich flavor of the jam. They also have some other house specialties ranging from swordfish steak to chicken parmesan. To add to the meal selection, the Hanover Street Chophouse also has a variety of sides to go with the main course. These include roasted mushrooms, baked mac n’ cheese, hand-cut French fries and truffled tater tots. The Hanover Street Chophouse also hosts an impressive collection of wines, whiskeys and cocktails. With a full wine cellar beneath the restaurant, there are an overwhelming number of options to choose from. However, the servers are happy to help. Their cocktails are not half bad as well. Their B’s Knees is sweet with a punch, and nobody can go wrong with a classic Old Fashioned. Make no mistake, this is fine dining. A meal at the Chophouse will run a pretty penny, with their least expensive steak cut, an 8-ounce filet mignon, costing $42.00. However, when the time comes for an above-average meal for a celebration, the Hanover Street Chophouse is the place to go."
    },
    {
        "title":"SNHU Prepares to “Rock the Night Away”",
        "preview":"",
        "image":"radiosnhu",
        "imageCaption":"The RadioSNHU logo (image source: Brendan Mcguire)",
        "category":"ARTS & ENTERTAINMENT",
        "author":"Joshua Dinapoli",
        "date":"November 5, 2021",
        "content":"RadioSNHU will be hosting the “Rock the Night Away” event at the Last Chapter Pub on December 4. This year’s occasion will be bringing in students from the Berklee College of Music in Boston. “Rock the Night Away is a night for students to come and enjoy some great live music in the Pub,” said Zachary Davidson, President of RadioSNHU (’22). “This will be a 4-hour event featuring several different genres of music.” The collaboration with Berklee will go beyond bringing in musicians. RadioSNHU expects to bring in a sound technician from the college to help with audio mixing. “This means we are going to have really great soul coming from the stage, and everything will be mixed professionally,” said Davidson. Davidson also spoke highly of the performers themselves. “They are all top-performing musicians at Berklee, some of whom have sponsorships and endorsements through major bands,” he said. “Many of them have been on tour around the world before.”RadioSNHU is the sole sponsor of the event. However, Davidson stated that the club is open to cosponsorships. Additionally, the club has no plans to broadcast it but will consider streaming. As the event draws closer to its date, RadioSNHU will make an effort to promote it across campus. Strategies include hanging up flyers and photos. Beyond that, the club has considered producing a promotional reel summarizing the event. Since this is not the first time the “Rock the Night Away” event has been held, RadioSNHU wants to ensure it sticks out this year. “We are hiring very talented musicians and sound tech,” Davidson says. “This means the caliber of music coming from our artists, as well as the sound in the Pub, will be on a much more professional level than what we have previously hosted.”"
    },
    {
        "title":"McIninch Gallery Features Artist Nicole Eisenman",
        "preview":"",
        "image":"artgallery",
        "imageCaption":"Nicole Eisenmen’s prints on display (image source: Logan Mock)",
        "category":"ARTS & ENTERTAINMENT",
        "author":"Logan Mock",
        "date":"October 18, 2021",
        "content":"Robert Frost’s McIninch Art Gallery is featuring prints by artist Nicole Eisenman until December 21. There are 17 prints displayed, including “Tea Party,” “12 Heads,” and “Fleet Week.” They can be seen in-person or virtually. Viewers of the virtual exhibition will be able to use the guided tour feature provided. The gallery description of Eisenman’s prints says, “Eisenman evokes wit and sentiment to the human condition as a way to dissolve prejudices of individuals who identify in any number of ways…Eisenman employs a mixture of surrealism and expressionism, which reveals the highs and lows of the human experience. The artist creates a complex world of love, melancholy, appetite, spirituality, and desire.” Eisenman will also participate in The Portrait: Real and Imagined webinar on November 17 at 5pm. The webinar will focus on their works. Guests will be able to analyze their influences, inspiration, and meanings behind their pieces.“[Their art] really speaks to human nature, and I love [it],” said Andrew Chronister (’25).Eisenman began as a traditional artist and painter, influenced by classic artists like Pablo Picasso. In 2011, they gave up painting and experimented with their art style. They eventually found an affinity for the medium of print. Eiseman’s works have earned them several awards, granting them the MacArthur Fellowship status. The results of Eiseman’s art are often dark and humorous in tone, drawing inspiration from the world around them. In an interview after winning the fellowship, Eisenman said, “I think the external world filters into my work, and all the themes are in there because I’m taking everything in.” The McIninch Art Gallery’s mission statement for the permanent collection is “to encourage curiosity and applied critical thinking about art and its role in society through curated learning paths and original works of art.” Sign-ups for the webinar will be available soon, and updates can be found on the gallery Instagram page @snhu_mcininchartgallery. "
    },
    {
        "title":"Dealing With Burnout",
        "preview":"",
        "image":"wellnesscenter",
        "imageCaption":"Wellness Center (photo source: Taylor Posik)",
        "category":"LIFESTYLE",
        "author":"Taylor Posik",
        "date":"November 4, 2021",
        "content":"With the transition to campus, staff and students have been experiencing burnout over the course of the semester as schedules and workloads have grown. “I feel like there’s definitely times where I’m stressed out,” said Olukpe Viakinnou (’25). “I have a lot of work I need to get done and have, like, a lot of extracurricular activities that I have to manage as well.” After a year of remote learning, staff and students are having to readjust to life on campus. Because of this, everyone is lacking a sense of normalcy. “Burnout is feeling emotionally, physically, and mentally exhausted,” said Elyse Peredna, Assistant Director of Counseling Services. It is a product of an overabundance of stress that seems impossible to manage. People experiencing this will feel unmotivated, be prone to procrastination, and will lose interest in the activities they enjoy. Burnout is created by an overwhelming amount of stress. “It’s also this state of just not being invested and not feeling purpose in what we’re doing,” Peredna said. After returning to in-person classes, students may be feeling overwhelmed with social pressure. “Over the last year and a half they were behind a screen…There weren’t as many in-person events and meetings,” said Peredna. “Now that they’re back on campus, they’re excited for those things but also they’re just feeling really exhausted by a lot of that, too, so it’s okay to take time for yourself.” Practicing self-care can help to prevent the effects of burnout. This can include getting exercise, maintaining a healthy diet, and getting enough sleep. Having a daily routine and setting work and social boundaries can give a sense of control. Additionally, taking the time to unplug and participate in activities outside of school and work can be beneficial for a person’s health. Students can seek support from their advisor, the Learning Center, or can contact the Wellness Center at 603-645-9679 or wellness@snhu.edu."
    },
    {
        "title":"Cross Campus Construction",
        "preview":"",
        "image":"construction",
        "imageCaption":"Main stairway. (image source: Emily Blais)",
        "category":"NEWS",
        "author":"Andrew Wilson",
        "date":"October 14, 2021",
        "content":"All across the SNHU campus there is caution tape, fences and warning signs surrounding sites under construction. These sites include the SETA (School of Engineering, Technology and Aeronautics) building, Penmen Stadium and the quad stairs on the green space. The work being done on each site varies in scope, but the stairs, most notably, have caused students to have to change their routes or usual patterns around campus. The quad stairs are at the heart of campus and are the most direct way to cross the street. The fencing surrounding the stairs on all sides has lead many to wonder what was wrong with them and when they will be fixed. “The quad stairs are approaching 10 years old and for the second time in that period, the concrete is failing where the nosing (metal edge protector) is anchored into the concrete,” said Scott Greeb, Assistant Vice President of Facilities Management. “This is caused by many factors including what is used for ice melt, surface treatment, freeze/thaw cycles, etc.” This project was planned to run before the pandemic hit but was put on ice when it did. When the freeze on projects was lifted, the stairs restoration was considered high priority and meant to be completed before the start of the fall semester. However, due to an issue with granite suppliers, the project was delayed again. “Construction will start as soon as late October and we hope to have it wrapped up in early December, weather permitting,” says Greeb. For now, students will have to make do with the walkway to the left of the stairs that leads towards Robert Frost Hall. “To leave the stairs open with the failing nosing just isn’t an option we were willing to entertain. The liability to students, staff and faculty would’ve been just too much. Although they look in a safe condition from a distance, the nosing/concrete connection could catastrophically fail at any time and is dangerous to the sheer volume of foot traffic those stairs see,” said Greeb. Over at the Stadium, more construction is going on. This includes the field itself, HVAC (Heating, Ventilation, and Air Conditioning), the Americans with Disabilities Act (ADA) compliance issues and more. A leaking problem is the reason the concourse area is taped off as they replace the concrete with pavers. Just recently, some of those sections that were previously cordoned off have been made accessible. Meanwhile at SETA, there is scaffolding set up around the building to solve the issue of falling slate from the façade of the building. Over in Robert Frost, students may have noticed the stairs got an upgrade within the first few weeks of classes. They got a face lift, including new carpet on the landings, new stair treads, and a new coat of paint. When asked about why there are so many projects happening on campus at once, Greeb stated, “A lot of it is related to the timing of unpausing projects and trying to wrap them up before school started. To pick up momentum with projects after being paused for so long can lose some valuable time. It’s the cost of starting/stopping things. However, we are asking that folks just hang in there while we wrap them up. There was no playbook for the pandemic.”"
    }
]