[
    {
        "title":"Dining Hall Disaster",
        "saved": false,
        "image":"Dining-Hall-Disaster",
        "imageCaption":"A Dining Hall chicken sandwich served with mold (image courtesy: Calie Wilbar)",
        "category":"_NEWS",
        "author":"Lillian Nelson",
        "date":"November 5, 2021",
        "content":"Students have recently noticed some issues in the dining hall with long lines, food quality and moldy products. Sodexo responded to the complaints in an interview with Sodexo’s General Manager, Daniel VanAvery. As seen on social media platforms such as the SNHU Barstool Instagram, students have reported receiving moldy bread, salad with plastic in it, uncooked steak, uncooked chicken, and rubber bands around broccoli. “It was a mistake. I think we got it all squared away. For a week it happened regularly,” said VanAvery when asked about the moldy bread. VanAvery explained that some deliveries were marked with the wrong dates when shipped at the beginning of the semester. The Sodexo team uses the same method of putting out food as grocery stores do; food expiring sooner goes to the front and food expiring later goes to the back. Thinking the bread was only one day old, as it was labeled, it was brought to the front. In reality it was three days old and was served to some students. VanAvery also commented when asked about students finding rubber bands around their stalks of vegetables. He said Sodexo struggled with staffing throughout the pandemic and his staff is “working back-to-back shifts” and putting in long hours at the dining hall, so a couple meals were missed in production and served to students. Longer lines have also been a problem in the dining hall, even longer than in previous years on campus. When asked about the matter VanAvery said, “70 percent of their staff is new….We had 50 job openings, staff retired and then the pandemic happened.” Sodexo staff is working long shifts to get through the nearly 30,000 transactions in just a week. With new staff needing to be trained and other staff needing to be in different areas in the kitchen, the lines got longer. Staff shortages and delivery issues caused a stir in the dining hall since returning to campus. “It was a mistake….It’s not okay. At no point is it okay and…of course, it’s not [Sodexo’s] standard. Our goal is always to serve the best food. Good food every day,” said VanAvery."
    },
    {
        "title":"Time to “Begin Again” With the Release of Taylor’s Version Albums",
        "saved": false,
        "image":"tswift",
        "imageCaption":"Taylor Swift’s “Red” Album (image source: Taylor Posik)",
        "category":"_ARTS & ENTERTAINMENT",
        "author":"Taylor Posik",
        "date":"November 3, 2021",
        "content":"Singer-songwriter Taylor Swift is set to release her album, “Red (Taylor’s Version),” on November 12. It will include all of the songs from her “Red” album (2012) along with an extended 10-minute song and unheard selections from the vault. Tracks from the vault will feature Chris Stapleton, Phoebe Bridgers, Mark Foster, and Ed Sheeran. “I can’t wait til we can dust off our highest hopes and relive these memories together. We’ll also be making a bunch of new ones, too,” Swift said in a social media post. Since the beginning of 2021, Swift has been working on releasing all her previous albums re-recorded. “Fearless (Taylor’s Version),” was released in April and has risen to the number one spot on The Rolling Stones Top 200 Album Chart, according to Rolling Stones Director of Charts, Emily Blake. Swift also released a re-recorded single from her “1989” album, “Wildest Dreams” in September. Next in the music lineup will be the release of more Taylor’s Version albums, including “Red,” “Speak Now,” “1989,” and “Reputation.” However, Swift will have to wait until 2022 for the latter due to the contract with the previous record label, Big Machine Records. Controversy sparked after the artist left Big Machine Records and signed onto Republic Records and Universal Music Group in 2018. In an article explaining why she is re-recording her album, journalist Jessica Sager wrote in Parade, “Swift would later reveal that she attempted to negotiate with Big Machine to gain ownership of the masters of her first six albums but was turned down.” This included her not being allowed to perform her old songs at the 2019 AMAs after winning Artist of the Decade. However, the artist was able to perform her original setlist, including the following titles: “The Man,” “Love Story,” “I Knew You Were Trouble,” “Blank Space,” “Shake It Off,” and “Lover.” Despite the setback, Swift has recorded three albums, including “Lover,” “Folklore,” and “Evermore.” Fans and other music lovers can listen to her music on streaming services such as Spotify, Apple Music, or can download them from the iTunes Store."
    },
    {
        "title":"Hanover Street Chophouse: A Pricey But Incredible Meal",
        "saved": false,
        "image":"steak",
        "imageCaption":"(image credit: Hanover Street Chophouse)",
        "category":"_LIFESTYLE",
        "author":"Andrew Wilson",
        "date":"October 29, 2021",
        "content":"Fine dining is not usually a staple of the college experience, but from time to time there is the need to have a fancy dinner. Be it an anniversary, a birthday, or even a graduation, the Hanover Street Chophouse is the place to go. As the name implies, it is located on Hanover Street in Manchester, approximately 15 minutes from SNHU’s main campus. They offer incredible dishes of steak and fish cuts, along with a robust wine and whiskey menu. Their selection of the appetizers, sides, and main courses is relatively small, but what the menu lacks in quantity is made up for in quality. Their bacon-wrapped sea scallops served with their house horseradish mustard is sublime. The maple bacon blending with the salty scallops and the kick of the horseradish mustard make for a wonderful start to the night. Other appetizers include the Colossal Crab Cocktail: crab served with avocado and fritonaise sauce; HSC Meatballs, served with a celery root puree, mushrooms, and grana padana; and Wagyu Beef Carpaccio, served with arugula, Worcestershire aioli, truffle, parmesan, and crostini. Their main courses are the real show-stoppers. Most dishes offered are steak, ranging from prime New York sirloin to prime Delmonico. A selection of steak add-ons complete the meal, some of the best being the truffle butter and the bacon maple bourbon jam. The filet mignon with bacon maple jam has a perfect combination of flavors. It cuts like butter and is topped with the rich flavor of the jam. They also have some other house specialties ranging from swordfish steak to chicken parmesan. To add to the meal selection, the Hanover Street Chophouse also has a variety of sides to go with the main course. These include roasted mushrooms, baked mac n’ cheese, hand-cut French fries and truffled tater tots. The Hanover Street Chophouse also hosts an impressive collection of wines, whiskeys and cocktails. With a full wine cellar beneath the restaurant, there are an overwhelming number of options to choose from. However, the servers are happy to help. Their cocktails are not half bad as well. Their B’s Knees is sweet with a punch, and nobody can go wrong with a classic Old Fashioned. Make no mistake, this is fine dining. A meal at the Chophouse will run a pretty penny, with their least expensive steak cut, an 8-ounce filet mignon, costing $42.00. However, when the time comes for an above-average meal for a celebration, the Hanover Street Chophouse is the place to go."
    },
    {
        "title":"SNHU Prepares to “Rock the Night Away”",
        "saved": false,
        "image":"radiosnhu",
        "imageCaption":"The RadioSNHU logo (image source: Brendan Mcguire)",
        "category":"_ARTS & ENTERTAINMENT",
        "author":"Joshua Dinapoli",
        "date":"November 5, 2021",
        "content":"RadioSNHU will be hosting the “Rock the Night Away” event at the Last Chapter Pub on December 4. This year’s occasion will be bringing in students from the Berklee College of Music in Boston. “Rock the Night Away is a night for students to come and enjoy some great live music in the Pub,” said Zachary Davidson, President of RadioSNHU (’22). “This will be a 4-hour event featuring several different genres of music.” The collaboration with Berklee will go beyond bringing in musicians. RadioSNHU expects to bring in a sound technician from the college to help with audio mixing. “This means we are going to have really great soul coming from the stage, and everything will be mixed professionally,” said Davidson. Davidson also spoke highly of the performers themselves. “They are all top-performing musicians at Berklee, some of whom have sponsorships and endorsements through major bands,” he said. “Many of them have been on tour around the world before.”RadioSNHU is the sole sponsor of the event. However, Davidson stated that the club is open to cosponsorships. Additionally, the club has no plans to broadcast it but will consider streaming. As the event draws closer to its date, RadioSNHU will make an effort to promote it across campus. Strategies include hanging up flyers and photos. Beyond that, the club has considered producing a promotional reel summarizing the event. Since this is not the first time the “Rock the Night Away” event has been held, RadioSNHU wants to ensure it sticks out this year. “We are hiring very talented musicians and sound tech,” Davidson says. “This means the caliber of music coming from our artists, as well as the sound in the Pub, will be on a much more professional level than what we have previously hosted.”"
    },
    {
        "title":"McIninch Gallery Features Artist Nicole Eisenman",
        "saved": false,
        "image":"artgallery",
        "imageCaption":"Nicole Eisenmen’s prints on display (image source: Logan Mock)",
        "category":"_ARTS & ENTERTAINMENT",
        "author":"Logan Mock",
        "date":"October 18, 2021",
        "content":"Robert Frost’s McIninch Art Gallery is featuring prints by artist Nicole Eisenman until December 21. There are 17 prints displayed, including “Tea Party,” “12 Heads,” and “Fleet Week.” They can be seen in-person or virtually. Viewers of the virtual exhibition will be able to use the guided tour feature provided. The gallery description of Eisenman’s prints says, “Eisenman evokes wit and sentiment to the human condition as a way to dissolve prejudices of individuals who identify in any number of ways…Eisenman employs a mixture of surrealism and expressionism, which reveals the highs and lows of the human experience. The artist creates a complex world of love, melancholy, appetite, spirituality, and desire.” Eisenman will also participate in The Portrait: Real and Imagined webinar on November 17 at 5pm. The webinar will focus on their works. Guests will be able to analyze their influences, inspiration, and meanings behind their pieces.“[Their art] really speaks to human nature, and I love [it],” said Andrew Chronister (’25).Eisenman began as a traditional artist and painter, influenced by classic artists like Pablo Picasso. In 2011, they gave up painting and experimented with their art style. They eventually found an affinity for the medium of print. Eiseman’s works have earned them several awards, granting them the MacArthur Fellowship status. The results of Eiseman’s art are often dark and humorous in tone, drawing inspiration from the world around them. In an interview after winning the fellowship, Eisenman said, “I think the external world filters into my work, and all the themes are in there because I’m taking everything in.” The McIninch Art Gallery’s mission statement for the permanent collection is “to encourage curiosity and applied critical thinking about art and its role in society through curated learning paths and original works of art.” Sign-ups for the webinar will be available soon, and updates can be found on the gallery Instagram page @snhu_mcininchartgallery. "
    },
    {
        "title":"Dealing With Burnout",
        "saved": false,
        "image":"wellnesscenter",
        "imageCaption":"Wellness Center (photo source: Taylor Posik)",
        "category":"_LIFESTYLE",
        "author":"Taylor Posik",
        "date":"November 4, 2021",
        "content":"With the transition to campus, staff and students have been experiencing burnout over the course of the semester as schedules and workloads have grown. “I feel like there’s definitely times where I’m stressed out,” said Olukpe Viakinnou (’25). “I have a lot of work I need to get done and have, like, a lot of extracurricular activities that I have to manage as well.” After a year of remote learning, staff and students are having to readjust to life on campus. Because of this, everyone is lacking a sense of normalcy. “Burnout is feeling emotionally, physically, and mentally exhausted,” said Elyse Peredna, Assistant Director of Counseling Services. It is a product of an overabundance of stress that seems impossible to manage. People experiencing this will feel unmotivated, be prone to procrastination, and will lose interest in the activities they enjoy. Burnout is created by an overwhelming amount of stress. “It’s also this state of just not being invested and not feeling purpose in what we’re doing,” Peredna said. After returning to in-person classes, students may be feeling overwhelmed with social pressure. “Over the last year and a half they were behind a screen…There weren’t as many in-person events and meetings,” said Peredna. “Now that they’re back on campus, they’re excited for those things but also they’re just feeling really exhausted by a lot of that, too, so it’s okay to take time for yourself.” Practicing self-care can help to prevent the effects of burnout. This can include getting exercise, maintaining a healthy diet, and getting enough sleep. Having a daily routine and setting work and social boundaries can give a sense of control. Additionally, taking the time to unplug and participate in activities outside of school and work can be beneficial for a person’s health. Students can seek support from their advisor, the Learning Center, or can contact the Wellness Center at 603-645-9679 or wellness@snhu.edu."
    },
    {
        "title":"Cross Campus Construction",
        "saved": false,
        "image":"construction",
        "imageCaption":"Main stairway. (image source: Emily Blais)",
        "category":"_NEWS",
        "author":"Andrew Wilson",
        "date":"October 14, 2021",
        "content":"All across the SNHU campus there is caution tape, fences and warning signs surrounding sites under construction. These sites include the SETA (School of Engineering, Technology and Aeronautics) building, Penmen Stadium and the quad stairs on the green space. The work being done on each site varies in scope, but the stairs, most notably, have caused students to have to change their routes or usual patterns around campus. The quad stairs are at the heart of campus and are the most direct way to cross the street. The fencing surrounding the stairs on all sides has lead many to wonder what was wrong with them and when they will be fixed. “The quad stairs are approaching 10 years old and for the second time in that period, the concrete is failing where the nosing (metal edge protector) is anchored into the concrete,” said Scott Greeb, Assistant Vice President of Facilities Management. “This is caused by many factors including what is used for ice melt, surface treatment, freeze/thaw cycles, etc.” This project was planned to run before the pandemic hit but was put on ice when it did. When the freeze on projects was lifted, the stairs restoration was considered high priority and meant to be completed before the start of the fall semester. However, due to an issue with granite suppliers, the project was delayed again. “Construction will start as soon as late October and we hope to have it wrapped up in early December, weather permitting,” says Greeb. For now, students will have to make do with the walkway to the left of the stairs that leads towards Robert Frost Hall. “To leave the stairs open with the failing nosing just isn’t an option we were willing to entertain. The liability to students, staff and faculty would’ve been just too much. Although they look in a safe condition from a distance, the nosing/concrete connection could catastrophically fail at any time and is dangerous to the sheer volume of foot traffic those stairs see,” said Greeb. Over at the Stadium, more construction is going on. This includes the field itself, HVAC (Heating, Ventilation, and Air Conditioning), the Americans with Disabilities Act (ADA) compliance issues and more. A leaking problem is the reason the concourse area is taped off as they replace the concrete with pavers. Just recently, some of those sections that were previously cordoned off have been made accessible. Meanwhile at SETA, there is scaffolding set up around the building to solve the issue of falling slate from the façade of the building. Over in Robert Frost, students may have noticed the stairs got an upgrade within the first few weeks of classes. They got a face lift, including new carpet on the landings, new stair treads, and a new coat of paint. When asked about why there are so many projects happening on campus at once, Greeb stated, “A lot of it is related to the timing of unpausing projects and trying to wrap them up before school started. To pick up momentum with projects after being paused for so long can lose some valuable time. It’s the cost of starting/stopping things. However, we are asking that folks just hang in there while we wrap them up. There was no playbook for the pandemic.”"
    },
    {
        "title":"How to SNHU: Combating Boredom on Campus",
        "saved": false,
        "image":"combatingboredom",
        "imageCaption":"Inter-Greek Council (image courtesy: SNHU Involvement)",
        "category":"_NEWS",
        "author":"Andrew Wilson",
        "date":"September 21, 2021",
        "content":"The fall 2021 semester is in full swing, and with it come new challenges for students. Not only must the first years adjust to campus life, but so too must the sophomores, juniors and seniors after a year of remote learning. While some never got to be on campus, the rest haven’t been on campus in over a year. The return is exciting, however, combating boredom is an important challenge to address. Upon returning to campus, there will be many activities for students to participate in. With all of the following suggestions, bear in mind that they may be subject to change with the Covid restrictions that have been placed. One of the easiest ways to avoid boredom on campus is to join a club. SNHU has over 75 clubs and organizations to get involved in. The involvement fair will have many of these clubs set up to look at and talk to representatives. It will be taking place on Wednesday, September 8 at 12 pm, according to the SNHU calendar. Joining a club can be an easy way to meet new people, entertain oneself and even bolster a resume. Organizations often have weekly meetings, which can help fill out a schedule and prevent too much downtime. A good place to find out what’s happening on campus is in the SNHU events calendar, which is accessible on the mySNHU homepage in the top right-hand column. The calendar provides information on events that are happening on campus, including the event’s date, time and location. Students can even sync it up to their Google or Outlook calendar. One of the most popular activities is Bingo which is held on Wednesday nights. It is a great way to hang out with people and have some fun. Once a month Big Money Bingo is held where prizes offered often include TVs, air pods and gift cards. Students can also look at the calendar to check the schedule of the many campus sports teams. From soccer at Penmen Stadium to field hockey at Larkin Field, and hockey down at the Ice Den Arena, there is a sport for everyone to watch and enjoy. In addition, students can hang out in popular places to get to know people. The Last Chapter Pub (the Pub) is a great example of this. Located in the Student Center, the Pub is a place to relax and be entertained. Their Facebook page description states, “We host comedians and musicians also so if you love a good laugh then the pub is your hub! And one of the best parts is you don’t have to drive anywhere! It’s a five minute walk from most places on campus.” Besides the Pub, the library is a great place to get homework done or to grab a book to read. If students have some downtime, another spot to interact with people is in the common areas, which are located in every housing building on campus. It is a great place for students to meet new people in their building. For students with a car, off-campus locations like Ben and Jerry’s on Elm Street is a popular spot to go to after a hard day’s work. Whether a new student or a returning one, there are many activities to get oneself involved in on campus to combat any boredom or isolation."
    },
    {
        "title":"Crime on Campus: The Clery Report",
        "saved": false,
        "image":"wolak",
        "imageCaption":"Wolak Learning Center. (image source: Joshua DiNapoli)",
        "category":"_NEWS",
        "author":"Joshua Dinapoli",
        "date":"October 14, 2021",
        "content":"With the annual Clery report now released, the faculty and students of SNHU now have access to public data that shows the safety profile of the campus. While the data only extends to last year, it provides a trend of how crime has shifted in three years (2018, 2019, 2020). With the advent of the COVID pandemic, there is a clear comparison for how the lower population might have impacted the reported rate of crime incidents. The report itself breaks the data down by where the crime occurred. Additionally, it includes any criminal offenses that might have been unfounded. According to the report, there have been no falsely reported crimes in the last three years. One of the most notable inferences from the data set is the consistent reports of robbery and motor vehicle theft. In the last three years, there have been no reported cases of these crimes. Another consistent statistic has been the presence of aggravated assaults. Similar to robberies and other theft, this crime has also been nonexistent in the last three recorded years. The only theft-related crime reported in the previous three years was burglary. However, there was only a reported incident at a residence hall back in 2018. Since then, there have not been any reported crime incidents of this categorization. While some crimes have been consistently nonexistent, others have been counted. Statistically, there were six reported cases of sexual assault in 2018. Over the next year, the rate of reported incidents remained constant. In 2020 the crime rate did drop to only one case; however, interpretation of this statistic must consider the significantly lower student population post-March. Other crimes, such as fondling, had a rate as high as seven in 2018 before dropping to only one reported case in 2019 and 2020.In addition to recording the number of criminal offenses, the report also keeps track of noted arrests. Broken down further by the type of offense, the categories are liquor law violations, possession or carrying of weapons and drug abuse. Out of the three categories, there has only been one arrest noted due to liquor law violations. While the arrest rate is notably low, the same cannot be said for disciplinary referrals. When referrals are taken into account, weapon violations consistently remain at zero. However, drug abuse violations ranged from nine to ten except for 2020 where no referrals occurred. Disciplinary action was the highest for liquor law violations, which reached 200 cases in 2018. Like other categories, these reports declined following the drop in student population. However, even in 2020, the rate was at 21, double the peak of drug abuse violations in 2019. For offenses listed under the Violence Against Women Act (VAWA), the report lists the three categories of domestic violence, dating violence and stalking. While there have been no known domestic violence incidents on campus in the last three years, there has been one listed incident of stalking each year since 2018.Reports of dating violence fluctuated over the three years from four cases during 2018, dipping to none in 2019, before rising back to two cases in 2020. Finally, any reported hate crimes are listed, for which there have been none in the last three years."
    },
    {
        "title":"How to SNHU: Time Management",
        "saved": false,
        "image":"timemanagement",
        "imageCaption":"(image courtesy: Breeze)",
        "category":"_LIFESTYLE",
        "author":"Christopher Kelly",
        "date":"September 21, 2021",
        "content":"Moving onto a college campus involves a lot of change simultaneously. Therefore, it’s important to remember time management. Students should remember there are only so many hours in a day and they should leave time for themselves. One way to accomplish this is to treat assignments like projects by starting them early and chipping away at them over time. This strategy will keep assignments from piling up and reduce stress to the college experience, which will help avoid late nights and missing sleep. Another strategy students can use to ensure they leave time for themselves is to write down assignment due dates and time commitments. This will help students track their time so they don’t fill up their schedule. For new students, time management in college can be a difficult change from high school. When asked about the differences between high school and college, Evy Hill (’23) said it was the amount of reliability. “Going online made it very difficult to balance everything going on in the world around me,” said Hill. “Writing it down on paper and visually seeing it made me keep better time schedules.” If students have trouble with assignments, there are plenty of resources to help them. Teachers have office hours to answer questions and provide help on assignments. Classmates are another resource students can use to set up study groups or ask for help with assignments. The Shapiro Library also offers tutoring services and workshops for anyone. Another service offered by the library is the Chat 24/7 with a Librarian link to answer any questions by students and to help find any necessary information. Study rooms are also available to provide a quiet space to complete assignments or work on team projects. With the Covid-19 guidelines being enacted on SNHU campus, there is concern about the availability of resources at the Shapiro Library. When asked if there would be services available in the fall, Heather Walker-White, Manager of Library Information Services, said that study rooms would be available for students to use. “At this time, we plan to re-open the Wolak Learning Center (WLC) on Monday, August 16, with limited summer hours until fall classes resume at the end of August,” Walker-White said. “The study room reservations calendar will reflect available times beginning August 16, and fall semester hours will begin Sunday, August 29.”There are seven group study rooms and a screening room for all students to use. To reserve a room, go to the library homepage, click the reserve a study room option (third from the bottom in Quick Links) and choose a time. As long as the reservation is confirmed within four hours, the study room will be reserved. SNHU provides many resources to help with time management of all kinds so students can work with confidence."
    },
    {
        "title":"Baby Keem Takes Rap Scene by Storm With Powerful Debut",
        "saved": false,
        "image":"babykeem",
        "imageCaption":"Baby Keem drops two new singles. (image source: onestowatch.com)",
        "category":"_ARTS & ENTERTAINMENT",
        "author":"Stefan Karlberg",
        "date":"October 12, 2021",
        "content":"Los Angeles-based rapper Baby Keem made it clear that he deserves to be in the conversation for best rapper of the year since the release of his debut studio album, “The Melodic Blue.” Baby Keem isn’t brand new to the music scene. His 2019 song, “ORANGE SODA,” brought his first taste of virality and has more than 2 million plays on Spotify. Mostly known for making faster-tempo songs such as “STATS,” “MOSHPIT,” and the self-titled “BABY KEEM,” Keem expands his sound in “The Melodic Blue.” The album was preceded by singles “hooligan,” “no sense,” “durag activity” and “family ties,” with the latter featuring 13-time Grammy Award winner Kendrick Lamar. Lamar, Keem’s cousin, also owns pgLang, the record label behind “The Melodic Blue.” Some critics have suggested that nepotism is behind the emergence of Baby Keem’s stardom, but he ignored the critics and dropped one of the most popular singles of this year. “Family ties” has already accrued 71 million streams almost two months after it was released, with thanks to TikTok virality. While “family ties” shares the upbeat sound Baby Keem has used so well, the complex instrumental and beat-switch are indictive of “The Melodic Blue’s” exploration of sound. From the first track, “trademark usa,” it is clear that “The Melodic Blue” is a new direction for Baby Keem. The samples in “pink panties” and “scapegoat” show a growth in beat production, which Keem was less involved in with his previous projects. Baby Keem still keeps bangers as a corner piece of this project, but he also experiments with slower and more intimate selections. “Issues,” “south africa” and “gorgeous” all feature a new sound. Baby Keem gives the listener a new view into his personal life; the line, “I can’t go ghost, I face demons/Don’t let it defeat you, all in my hands/I know it’s hard for you to come out that trance/I look myself in the mirror when I can,” from “issues” shows a more intimate view of Baby Keem beyond his stage persona. “The Melodic Blue” takes the audience for a ride unlike any other Baby Keem project. He supplies his iconic hard-hitting songs, but adds a new experience with his slow, introspective rap. Baby Keem will be performing in Boston on November 21 at the Paradise Rock Club."
    }
]